cases/hydrodynamic/risingBubble/2D/C2RESULTS_interFoam/160x320x001/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

//- Number of cells along x direction
nx 160;

//- Number of cells along y direction
ny #calc "2*$nx";

//- Number of cells along z direction
nz 1;

//- Position of cell faces in z empty-direction
zposm 0;
zposp #calc  "1.0/$nx";

vertices
(
    (-0.5 0 $zposm)
    ( 0.5 0 $zposm)
    ( 0.5 2 $zposm)
    (-0.5 2 $zposm)
    (-0.5 0 $zposp)
    ( 0.5 0 $zposp)
    ( 0.5 2 $zposp)
    (-0.5 2 $zposp)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch topWall
    (
        (3 7 6 2)
    )
    patch bottomWall
    (
        (1 5 4 0)
    )
    patch leftWall
    (
        (0 4 7 3)
    )
    patch rightWall
    (
        (2 6 5 1)
    )
    empty backWall
    (
        (0 3 2 1)
    )
    empty frontWall
    (
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
